// Hunt for potential phishing emails that link to a Microsoft OAuth login
// OAuth tokens can grant the 3rd party permissions without stealing credentials
// Logins take place on login.windows.net or login.microsoftonline.com which is less suspicious
EmailUrlInfo  
| where Url contains "https://login.windows.net/common/oauth2" or Url contains "https://login.microsoftonline.com/consumers/oauth2" 
| where Url contains "redirect_uri"
| join EmailEvents  on $left.NetworkMessageId == $right.NetworkMessageId
| where EmailDirection == "Inbound"
