DeviceFileEvents
| where FileName contains "password"
| where FileName endswith ".doc"
     or FileName endswith ".docx"
     or FileName endswith ".xls"
     or FileName endswith ".xlsx"
     or FileName endswith ".txt"
// --- add exclusions here ---//
| distinct DeviceName, InitiatingProcessAccountUpn, FileName, FolderPath