DeviceEvents
| where ActionType startswith 'Asr'
    and ActionType endswith 'Audited'
| summarize Count = count(), Categories = make_set(ActionType) by DeviceName, OnPremSid=AccountSid
| join IdentityInfo on OnPremSid
| project DeviceName, FullName=strcat(GivenName, " ", Surname), JobTitle, Count, Categories
| distinct DeviceName, FullName, JobTitle, Count, tostring(Categories)
| sort by Count