DeviceNetworkEvents
| where InitiatingProcessFileName !~ "rclone.exe"
and (InitiatingProcessVersionInfoCompanyName =~ "https://rclone.org"
or InitiatingProcessVersionInfoInternalFileName =~ "rclone"
or InitiatingProcessVersionInfoFileDescription =~ "Rsync for cloud storage"
or InitiatingProcessVersionInfoProductName =~ "Rclone")